#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_lightsail_static_ip.amplifica: Refreshing state... [id=amplifica]
aws_lightsail_instance.amplifica: Refreshing state... [id=amplifica_server]
cloudflare_record.amplifica: Refreshing state... [id=ad60a43465cd244eafc054a81299b3b1]
aws_lightsail_static_ip_attachment.amplifica: Refreshing state... [id=amplifica]
aws_lightsail_instance_public_ports.amplifica: Refreshing state... [id=amplifica_server-3143533893]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lightsail_instance.amplifica has changed
  ~ resource "aws_lightsail_instance" "amplifica" {
        id                 = "amplifica_server"
      ~ is_static_ip       = false -> true
        name               = "amplifica_server"
      ~ public_ip_address  = "18.118.140.106" -> "3.14.32.54"
        tags               = {
            "poc" = "true"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_lightsail_instance_public_ports.amplifica has changed
  ~ resource "aws_lightsail_instance_public_ports" "amplifica" {
        id            = "amplifica_server-3143533893"
        # (1 unchanged attribute hidden)

      - port_info {
          - cidrs     = [
              - "0.0.0.0/0",
            ] -> null
          - from_port = 3838 -> null
          - protocol  = "tcp" -> null
          - to_port   = 3838 -> null
        }
      - port_info {
          - cidrs     = [
              - "0.0.0.0/0",
            ] -> null
          - from_port = 443 -> null
          - protocol  = "tcp" -> null
          - to_port   = 443 -> null
        }
      + port_info {
          + cidrs     = [
              + "0.0.0.0/0",
            ]
          + from_port = 80
          + protocol  = "tcp"
          + to_port   = 80
        }
      - port_info {
          - cidrs     = [
              - "0.0.0.0/0",
            ] -> null
          - from_port = 8787 -> null
          - protocol  = "tcp" -> null
          - to_port   = 8787 -> null
        }
        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lightsail_instance.amplifica must be replaced
-/+ resource "aws_lightsail_instance" "amplifica" {
      ~ arn                = "arn:aws:lightsail:us-east-2:762560579492:Instance/fd374701-7a8b-4c8e-88fe-5d9a060b575a" -> (known after apply)
      ~ cpu_count          = 1 -> (known after apply)
      ~ created_at         = "2022-02-02T00:00:57Z" -> (known after apply)
      ~ id                 = "amplifica_server" -> (known after apply)
      ~ ipv6_address       = "2600:1f16:9c6:bb00:8686:7d61:f593:55f4" -> (known after apply)
      ~ ipv6_addresses     = [
          - "2600:1f16:9c6:bb00:8686:7d61:f593:55f4",
        ] -> (known after apply)
      ~ is_static_ip       = true -> (known after apply)
      - key_pair_name      = "LightsailDefaultKeyPair" -> null
        name               = "amplifica_server"
      ~ private_ip_address = "172.26.5.236" -> (known after apply)
      ~ public_ip_address  = "3.14.32.54" -> (known after apply)
      ~ ram_size           = 1 -> (known after apply)
      ~ tags               = {
          - "poc"     = "true" -> null
          + "project" = "amplifica"
        }
      ~ tags_all           = {
          - "poc"     = "true" -> null
          + "project" = "amplifica"
        }
      ~ user_data          = <<-EOT # forces replacement
            #!/bin/bash
            
            ##############################################################################
            # INSTALLING R, RSTUDIO SERVER AND ALL DEPENDENCIES
            ##############################################################################
            
            # Add a swap file to prevent build time OOM errors
            fallocate -l 16G /swapfile
            mkswap /swapfile
            swapon /swapfile
            echo '/swapfile none swap sw 0 0' | sudo tee -a /etc/fstab
            echo "vm.swappiness=10" >> /etc/sysctl.conf
            sysctl vm.swappiness=10
            
            sysctl vm.vfs_cache_pressure=50
            echo "vm.vfs_cache_pressure=50" >> /etc/sysctl.conf
            
            export DEBIAN_FRONTEND=noninteractive
            
            mkdir -p /root/.ssh /home/ubuntu/.ssh
            touch "/root/.ssh/authorized_keys"
            touch "/home/ubuntu/.ssh/authorized_keys"
            
            echo "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIGk0PvanXFve78EL4PRq70EL+6/afnBQr3atdKYcRgjA diraol@berta" | tee -a "/root/.ssh/authorized_keys" >> "/home/ubuntu/.ssh/authorized_keys"
            echo "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPBvCjgYwSkK3etS8pdqEKgPjAlVIGWbsbcVbuTz630h infra+amplifica@azmina.com.br" >> "/home/ubuntu/.ssh/authorized_keys"
            
            chown ubuntu:ubuntu "/home/ubuntu/.ssh/authorized_keys"
            chmod 700 /home/ubuntu/.ssh
            chmod 600 /home/ubuntu/.ssh/authorized_keys
            
            # Download rstudio server in a background task
            wget -q https://download2.rstudio.org/server/bionic/amd64/rstudio-server-2021.09.1-372-amd64.deb -O /tmp/rstudio_server_install.deb &
            # Download shiny server in a background task
            wget -q https://download3.rstudio.org/ubuntu-14.04/x86_64/shiny-server-1.5.17.973-amd64.deb -O /tmp/shiny_server_install.deb &
            
            apt update
            apt install --no-install-recommends -yqq \
                software-properties-common \
                dirmngr \
                build-essential \
                zlib1g-dev
            
            apt-key adv \
                --keyserver keyserver.ubuntu.com \
                --recv-keys E298A3A825C0D65DFD57CBB651716619E084DAB9
            wget -qO- https://cloud.r-project.org/bin/linux/ubuntu/marutter_pubkey.asc | \
                sudo tee -a /etc/apt/trusted.gpg.d/cran_ubuntu_key.asc
            add-apt-repository "deb https://cloud.r-project.org/bin/linux/ubuntu $(lsb_release -cs)-cran40/"
            
            # Install R-base
            apt update
            apt install --no-install-recommends r-base -yqq
            
            # Install r-server
            apt install /tmp/rstudio_server_install.deb -yqq
            
            # Install shiny package
            R --no-save -e "install.packages('shiny', repos='https://cran.rstudio.com/')"
            
            # Install shiny-server
            apt install /tmp/shiny_server_install.deb -yqq
            
            # access
          + mkdir -p /home/shiny/.ssh
          + chmod 700 /home/shiny/.ssh
            echo "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIGk0PvanXFve78EL4PRq70EL+6/afnBQr3atdKYcRgjA diraol@berta" >> "/home/shiny/.ssh/authorized_keys"
            echo "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPBvCjgYwSkK3etS8pdqEKgPjAlVIGWbsbcVbuTz630h infra+amplifica@azmina.com.br" >> "/home/shiny/.ssh/authorized_keys"
          - chown shiny:shiny "/home/ubuntu/.ssh/authorized_keys"
          - chmod 700 /home/shiny/.ssh
          + chown shiny:shiny "/home/shiny/.ssh/authorized_keys"
            chmod 600 /home/shiny/.ssh/authorized_keys
            
            # Setup the shiny server
            mkdir -p /src/shiny-server/amplifica
            chown shiny:shiny /src/shiny-server/amplifica
            sed -i 's/port 3838/port 80/g' /etc/shiny-server/shiny-server.conf
            sed -i 's!site_dir /srv/shiny-server!app_dir /src/shiny-server/amplifica!g' /etc/shiny-server/shiny-server.conf
            sed -i 's/directory_index on;/directory_index off;/g' /etc/shiny-server/shiny-server.conf
            
            systemctl restart shiny-server
            
            apt upgrade -yqq
            apt autoremove -yqq
            
            CPUS=$(nproc)
            if [[ "${CPUS}" != 1 ]]; then
                CPUS=$(( CPUS - 1 ))
            fi
            
            # Install additional packages
            cat << EOF > r_install_packages.R
            update.packages(ask=FALSE,
                Ncpus=${CPUS},
                lib="/usr/local/lib/R/site-library",
                checkBuilt=TRUE,
                quiet=TRUE,
                repos = "http://cran.us.r-project.org")
            
            install.packages(lib="/usr/local/lib/R/site-library",
            c(
                "R.utils",
                "stringr",
                "tidyverse"
                ),
                Ncpus=${CPUS},
                ask=FALSE,
                checkBuilt=TRUE,
                quiet=TRUE,
                repos = "http://cran.us.r-project.org"
            )
            
            q()
            EOF
            chmod +rw r_install_packages.R
            R --no-save < r_install_packages.R
            
            echo "www-port=80" > /etc/rstudio/rserver.conf
            echo "www-thread-pool-size=${CPUS}" >> /etc/rstudio/rserver.conf
            echo "session-timeout-minutes=0" >> /etc/rstudio/rsession.conf
            
            systemctl restart rstudio-server.service
          + 
          + # These passwords were generated using:
          + # perl -e 'print crypt("<MY_PASSWORD>", "password"), "\n"'
          + useradd -m -p 'paMixc6M.qQlA' -s /bin/bash amplifica
        EOT
      ~ username           = "ubuntu" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lightsail_instance_public_ports.amplifica must be replaced
-/+ resource "aws_lightsail_instance_public_ports" "amplifica" {
      ~ id            = "amplifica_server-3143533893" -> (known after apply)
        # (1 unchanged attribute hidden)

      + port_info { # forces replacement
          + cidrs     = (known after apply)
          + from_port = 22
          + protocol  = "tcp"
          + to_port   = 22
        }
      + port_info { # forces replacement
          + cidrs     = (known after apply)
          + from_port = 3838
          + protocol  = "tcp"
          + to_port   = 3838
        }
      + port_info { # forces replacement
          + cidrs     = (known after apply)
          + from_port = 443
          + protocol  = "tcp"
          + to_port   = 443
        }
      + port_info { # forces replacement
          + cidrs     = (known after apply)
          + from_port = 8787
          + protocol  = "tcp"
          + to_port   = 8787
        }
      - port_info { # forces replacement
          - cidrs     = [
              - "0.0.0.0/0",
            ] -> null
          - from_port = 22 -> null
          - protocol  = "tcp" -> null
          - to_port   = 22 -> null
        }
      - port_info { # forces replacement
          - cidrs     = [
              - "0.0.0.0/0",
            ] -> null
          - from_port = 80 -> null
          - protocol  = "tcp" -> null
          - to_port   = 80 -> null
        }
    }

  # aws_lightsail_static_ip_attachment.amplifica must be replaced
-/+ resource "aws_lightsail_static_ip_attachment" "amplifica" {
      ~ id             = "amplifica" -> (known after apply)
      ~ instance_name  = "amplifica_server" -> (known after apply) # forces replacement
      ~ ip_address     = "3.14.32.54" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_ssm_document.cloud_init_wait will be created
  + resource "aws_ssm_document" "cloud_init_wait" {
      + arn              = (known after apply)
      + content          = <<-EOT
            schemaVersion: '2.2'
            description: Wait for cloud init to finish
            mainSteps:
            - action: aws:runShellScript
              name: StopOnLinux
              precondition:
                StringEquals:
                - platformType
                - Linux
              inputs:
                runCommand:
                - cloud-init status --wait
        EOT
      + created_date     = (known after apply)
      + default_version  = (known after apply)
      + description      = (known after apply)
      + document_format  = "YAML"
      + document_type    = "Command"
      + document_version = (known after apply)
      + hash             = (known after apply)
      + hash_type        = (known after apply)
      + id               = (known after apply)
      + latest_version   = (known after apply)
      + name             = "cloud-init-wait"
      + owner            = (known after apply)
      + parameter        = (known after apply)
      + platform_types   = (known after apply)
      + schema_version   = (known after apply)
      + status           = (known after apply)
      + tags_all         = (known after apply)
    }

Plan: 4 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @diraol, Action: `pull_request`*